SGLang_Data_20260615_dp2_sweep/sglang/sglang-oai_dp2_rr1_il2048_ol512.log
benchmark_args=Namespace(backend='sglang-oai', base_url=None, host='127.0.0.1', port=32150, dataset_name='random', dataset_path='', model='/mnt/nfs02/users/tjiang/Gitrepo/models/Qwen3-8B', served_model_name=None, tokenizer=None, num_prompts=200, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=2048, random_output_len=512, random_range_ratio=0.0, image_count=1, image_resolution='1080p', image_format='jpeg', image_content='random', request_rate=1.0, use_trace_timestamps=False, max_concurrency=None, output_file='/mnt/nfs02/users/tjiang/Gitrepo/sglang/SGLang_Data_20260615_dp2_sweep/sglang/sglang-oai_dp2_rr1_il2048_ol512.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, seed=42, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)
Namespace(backend='sglang-oai', base_url=None, host='127.0.0.1', port=32150, dataset_name='random', dataset_path='', model='/mnt/nfs02/users/tjiang/Gitrepo/models/Qwen3-8B', served_model_name=None, tokenizer=None, num_prompts=200, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=2048, random_output_len=512, random_range_ratio=0.0, image_count=1, image_resolution='1080p', image_format='jpeg', image_content='random', request_rate=1.0, use_trace_timestamps=False, max_concurrency=None, output_file='/mnt/nfs02/users/tjiang/Gitrepo/sglang/SGLang_Data_20260615_dp2_sweep/sglang/sglang-oai_dp2_rr1_il2048_ol512.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, seed=42, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)

#Input tokens: 202736
#Output tokens: 52363
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang-oai
Traffic request rate:                    1.0       
Max request concurrency:                 not set   
Successful requests:                     200       
Benchmark duration (s):                  198.76    
Total input tokens:                      202736    
Total input text tokens:                 202736    
Total input vision tokens:               0         
Total generated tokens:                  52363     
Total generated tokens (retokenized):    52363     
Request throughput (req/s):              1.01      
Input token throughput (tok/s):          1020.03   
Output token throughput (tok/s):         263.45    
Peak output token throughput (tok/s):    731.00    
Peak concurrent requests:                10        
Total token throughput (tok/s):          1283.48   
Concurrency:                             3.28      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   3261.81   
Median E2E Latency (ms):                 3080.37   
---------------Time to First Token----------------
Mean TTFT (ms):                          81.82     
Median TTFT (ms):                        80.25     
P99 TTFT (ms):                           133.71    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          12.16     
Median TPOT (ms):                        12.12     
P99 TPOT (ms):                           13.11     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           12.20     
Median ITL (ms):                         11.93     
P95 ITL (ms):                            12.58     
P99 ITL (ms):                            18.05     
Max ITL (ms):                            111.53    
==================================================